src/InformationRegisters/Scan_КвотыSOrderFFUФакт/Scan_КвотыSOrderFFUФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_КвотыSOrderFFUФакт</name>
  <resources>
    <name>Опция</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказНаЗавод</name>
    <type>
      <types>CatalogRef.Scan_ЗаказыНаЗавод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОпции</name>
    <type>
      <types>CatalogRef.Scan_ТипыОпций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_КвотыSOrderFFUФакт/ManagerModule.bsl
Функция ПолучитьЗаказыНаЗаводСОтборомПоОпции(Опция) Экспорт
	Если НЕ ЗначениеЗаполнено(Опция) Тогда
		Возврат Неопределено
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Опция", Опция);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_КвотыSOrderFFUФакт.ЗаказНаЗавод КАК ЗаказНаЗавод
	               |ИЗ
	               |	РегистрСведений.Scan_КвотыSOrderFFUФакт КАК Scan_КвотыSOrderFFUФакт
	               |ГДЕ
	               |	Scan_КвотыSOrderFFUФакт.Опция = &Опция";
		
	СписокЗаказовНаЗавод = Запрос.Выполнить().Выгрузить();
		
	Возврат СписокЗаказовНаЗавод;
КонецФункции


Функция ПолучитьОпцию(ЗаказНаЗавод, ТипОпции) Экспорт
	МенеджерЗаписи = РегистрыСведений.Scan_КвотыSOrderFFUФакт.СоздатьМенеджерЗаписи();	
	
	МенеджерЗаписи.ЗаказНаЗавод 	= ЗаказНаЗавод;
	МенеджерЗаписи.ТипОпции 		= ТипОпции;
	МенеджерЗаписи.Прочитать();
	
	Возврат МенеджерЗаписи.Опция;	
КонецФункции
